- Importando as bibliotecas necessárias

In [119]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns

Designando o dataframe de teste e de treino

In [120]:
df_train = pd.read_csv("/home/thiago/datamining/store_sales/data/train.csv")
df_test = pd.read_csv("/home/thiago/datamining/store_sales/data/test.csv")
holidays_events = pd.read_csv("/home/thiago/datamining/store_sales/data/holidays_events.csv")
oil = pd.read_csv("/home/thiago/datamining/store_sales/data/oil.csv")
stores = pd.read_csv("/home/thiago/datamining/store_sales/data/stores.csv")
transactions = pd.read_csv("/home/thiago/datamining/store_sales/data/transactions.csv")

### Vamos fazer agora uma análise exploratória dos dados

In [121]:
print(df_train.shape)
print(df_test.shape)

(3000888, 6)
(28512, 5)

shapes diferentes!

In [122]:
df_train.head(5)

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [123]:
df_test.head(5)

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

removendo a id e ajeitando o tipo de data

In [124]:
df_train["date"] = pd.to_datetime(df_train["date"])
#df_train.index = df_train['id']
#df_train = df_train.drop("id",axis=1)

In [125]:
df_test["date"] = pd.to_datetime(df_test["date"])
#df_test.index = df_test['id']
#df_test = df_test.drop("id",axis=1)

In [126]:
df_train.head(10)

   id       date  store_nbr        family  sales  onpromotion
0   0 2013-01-01          1    AUTOMOTIVE    0.0            0
1   1 2013-01-01          1     BABY CARE    0.0            0
2   2 2013-01-01          1        BEAUTY    0.0            0
3   3 2013-01-01          1     BEVERAGES    0.0            0
4   4 2013-01-01          1         BOOKS    0.0            0
5   5 2013-01-01          1  BREAD/BAKERY    0.0            0
6   6 2013-01-01          1   CELEBRATION    0.0            0
7   7 2013-01-01          1      CLEANING    0.0            0
8   8 2013-01-01          1         DAIRY    0.0            0
9   9 2013-01-01          1          DELI    0.0            0

In [127]:
df_test.head(10)

        id       date  store_nbr        family  onpromotion
0  3000888 2017-08-16          1    AUTOMOTIVE            0
1  3000889 2017-08-16          1     BABY CARE            0
2  3000890 2017-08-16          1        BEAUTY            2
3  3000891 2017-08-16          1     BEVERAGES           20
4  3000892 2017-08-16          1         BOOKS            0
5  3000893 2017-08-16          1  BREAD/BAKERY           12
6  3000894 2017-08-16          1   CELEBRATION            0
7  3000895 2017-08-16          1      CLEANING           25
8  3000896 2017-08-16          1         DAIRY           45
9  3000897 2017-08-16          1          DELI           18

checando por valores nulos

In [128]:
df_train.isnull().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [129]:
df_test.isnull().sum()

id             0
date           0
store_nbr      0
family         0
onpromotion    0
dtype: int64

nenhum valor nulo no treino e no teste

testando se tem valores duplicados

In [130]:
df_train.duplicated().sum()

0

In [131]:
df_test.duplicated().sum()

0

sem valores duplicados

In [132]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         datetime64[ns]
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 137.4+ MB

In [133]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  datetime64[ns]
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.1+ MB

- Data e familia são atributos object, o que geralmente é um problema

In [134]:
df_train["family"].describe()

count        3000888
unique            33
top       AUTOMOTIVE
freq           90936
Name: family, dtype: object

In [135]:
df_test["family"].describe()

count          28512
unique            33
top       AUTOMOTIVE
freq             864
Name: family, dtype: object

33 familias diferentes

In [136]:
df_train["store_nbr"].describe()

count    3.000888e+06
mean     2.750000e+01
std      1.558579e+01
min      1.000000e+00
25%      1.400000e+01
50%      2.750000e+01
75%      4.100000e+01
max      5.400000e+01
Name: store_nbr, dtype: float64

In [137]:
df_train['store_nbr'].unique()

array([ 1, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19,  2, 20, 21, 22, 23, 24,
       25, 26, 27, 28, 29,  3, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39,  4,
       40, 41, 42, 43, 44, 45, 46, 47, 48, 49,  5, 50, 51, 52, 53, 54,  6,
        7,  8,  9])

54 lojas

preparando os dados da coluna familia

In [138]:
df_train['family'] = df_train['family'].astype('category')
df_train['family_category'] = df_train['family'].cat.codes #cria uma coluna com codigos numericos para cada familia
family_category = dict(zip(df_train['family'].cat.codes, df_train['family'])) # um dicionario reverso
family_category

{0: 'AUTOMOTIVE',
 1: 'BABY CARE',
 2: 'BEAUTY',
 3: 'BEVERAGES',
 4: 'BOOKS',
 5: 'BREAD/BAKERY',
 6: 'CELEBRATION',
 7: 'CLEANING',
 8: 'DAIRY',
 9: 'DELI',
 10: 'EGGS',
 11: 'FROZEN FOODS',
 12: 'GROCERY I',
 13: 'GROCERY II',
 14: 'HARDWARE',
 15: 'HOME AND KITCHEN I',
 16: 'HOME AND KITCHEN II',
 17: 'HOME APPLIANCES',
 18: 'HOME CARE',
 19: 'LADIESWEAR',
 20: 'LAWN AND GARDEN',
 21: 'LINGERIE',
 22: 'LIQUOR,WINE,BEER',
 23: 'MAGAZINES',
 24: 'MEATS',
 25: 'PERSONAL CARE',
 26: 'PET SUPPLIES',
 27: 'PLAYERS AND ELECTRONICS',
 28: 'POULTRY',
 29: 'PREPARED FOODS',
 30: 'PRODUCE',
 31: 'SCHOOL AND OFFICE SUPPLIES',
 32: 'SEAFOOD'}

In [139]:
fig, ax = plt.subplots()
ax.pie(df_train.sales, labels=df_train.family, autopct='%1.1f%%', startangle=90)
ax.axis('equal')  # Assegura que o gráfico de pizza seja um círculo

# Exibir gráfico
plt.show()